[
    {
        "id": 1,
        "img": "https://i.ibb.co/y4gnx7R/Rectangle-2-2.png",
        "title": "Introduction to C Programming",
        "credit": 6,
        "description": "Learn the basics of C programming language, including data types, variables, and control structures. Develop foundational programming skills through practical exercises.",
        "price": 99
    },
    {
        "id": 2,
        "img": "https://i.ibb.co/8d10prP/Rectangle-2-3.png",
        "title": "Introduction to Algorithms",
        "credit": 4,
        "description": "Understand the fundamental algorithms used in computer science. Explore sorting, searching, and graph algorithms through theoretical lectures and practical implementation.",
        "price": 120
    },
    {
        "id": 3,
        "img": "https://i.ibb.co/c6X7JCH/Rectangle-2-4.png",
        "title": "Introduction to C++ for DSA",
        "credit": 8,
        "description": "Learn C++ programming language for Data Structures and Algorithms. Develop a strong foundation in C++ and apply it to solve complex algorithmic problems.",
        "price": 150
    },
    {
        "id": 4,
        "img": "https://i.ibb.co/wsfBxRV/Rectangle-3.png",
        "title": "Basic Data Structures",
        "credit": 3,
        "description": "Explore fundamental data structures including arrays, linked lists, stacks, and queues. Understand their implementation and usage for efficient data management.",
        "price": 95
    },
    {
        "id": 5,
        "img": "https://i.ibb.co/YZN138j/Rectangle-2.png",
        "title": "Introduction to OOP Python",
        "credit": 7,
        "description": "Discover the principles of Object-Oriented Programming (OOP) using Python. Learn about classes, objects, inheritance, and polymorphism for efficient code organization.",
        "price": 200
    },
    {
        "id": 6,
        "img": "https://i.ibb.co/xgvPSSF/Rectangle-2-5.png",
        "title": "Software Engineering",
        "credit": 5,
        "description": "Gain insights into the principles of software development. Learn about software design, testing, and maintenance. Develop skills to manage complex software projects.",
        "price": 130
    },
    {
        "id": 7,
        "img": "https://i.ibb.co/hZhTHCz/Rectangle-3-1.png",
        "title": "AWS, Cloud Computing",
        "credit": 9,
        "description": "Explore the basics of Amazon Web Services (AWS) and cloud computing. Learn about cloud infrastructure, storage, and computing services provided by AWS.",
        "price": 180
    },
    {
        "id": 8,
        "img": "https://i.ibb.co/Xt1dx57/Rectangle-2-1.png",
        "title": "Database (MySQL)",
        "credit": 2,
        "description": "Learn the fundamentals of MySQL database management. Understand data modeling, querying, and database optimization techniques for efficient data storage and retrieval.",
        "price": 90
    },
    {
        "id": 9,
        "img": "https://i.ibb.co/0s6FfkY/Rectangle-2-6.png",
        "title": "Problem-Solving Part.",
        "credit": 10,
        "description": "Develop problem-solving skills for complex programming challenges. Learn strategies and techniques to approach and solve various algorithmic problems efficiently.",
        "price": 220
    }
]